Tekla Open API Reference for Tekla Structures 2025
Face Class
 The Face class represents a single face in a solid.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Solid.Face
 Namespace: Tekla.Structures.Solid
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class Face
Public NotInheritable Class Face
The Face type exposes the following members.
Properties
Name | Description
Normal
 The normal vector of the face.
OriginPartId
 The part id of the part that this face originated from. For example, a face create by a part cut has the id of the cutting part.
Top
Methods
Name | Description
GetLoopEnumerator
 Gets a new loop enumerator for enumerating through the face's loops.
Top
See Also
Reference
Tekla.Structures.Solid Namespace